app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @post = Post.find(params[:id]) # show action is running a database query on the post model that will return a post with an id that matches the routes parameter